testdata/m4/limits/expected-fan-max-nodes-5.mmd
flowchart TD
  m_db036d1d7f4a["app.Fan.callAll()"]
  m_fb4762201552["app.Fan.i1()"]
  m_ecbe378201d2["app.Fan.i2()"]
  m_0e41836d3ce6["app.Fan.i3()"]
  m_4edc0494cacd["app.Fan.i4()"]
  m_db036d1d7f4a --> m_fb4762201552
  m_db036d1d7f4a --> m_ecbe378201d2
  m_db036d1d7f4a --> m_0e41836d3ce6
  m_db036d1d7f4a --> m_4edc0494cacd
  t_d3541dffd380["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_3680ae55682c["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_93c9fc946e79["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_76dd65999851["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_903a78cc8a60["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_1ffdc6126966["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_0af97c45b501["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
  t_b91b95eb89c4["% truncation: node limit; omitted 1 while tracing app.Fan.callAll()"]
